import axios from "axios";

const prompts = [
  
    "{A} و {B} يذهبون إلى المعرض/حديقة الملاهي, و {A} يريد أن يذهب على السفينة الدوارة, و {B} يوافق. لاحقا, {B} يتذكر أنه إستماع كثيرا و يكون سعيدا بإتخاذه ذالك القراره وينتهي به الأمر بالتشبث ب {A} لمدى الحياة.",
  
"{B} لا يريد أن يتركه {A} الخروج من السرير عن طريق إحتضانه بقوة.",
"{A} هو يريد أن يذهب من أجل العمل. {B} يسألهم إذا كان قد نسي أي شيء (نتحدث عن الأم و الطفل)، و {A} يعطيه قبلة (نتحدث عن طفل صغير). {B} يتحول إلى اللون الأحمر ويفتح أيديه ليكشف {A}'s مفاتيح/محفظة/إلخ., يقول 'شكرا يا طفلي لقد كنت أنساهم.'",
"{A} يشتري علبة حلويات ويضعها في خزانة. {B} يأكلهم جميعًا تلقائيًا في منتصف الليل ويحاول إبقاء الأمر سراً.",
"{A} يحاول تعليم{B} كيفية التقبيل, و {B} يقوم بتقبيل و{A} يغضب بسرعة ويقول ما كان هذا؟ ثم يغادر  {A} يظل صامتا و مندهشا للحظات ويعم الصمت.",
"{A} و {B} النوم مع وضع رؤوسهم على كتف/رأس الآخر في المقعد الخلفي للسيارة أثناء قيادة أصدقائهم.",
"{B} يسأل ما إذا كان بوسعه مراجعة الدرس الفائت معه لأنه لم يكن حاضرا في الحصة {A}. {A} يقبل و يوافق على مراجعة الدرس الفائت مع {B}.",
"{A} و {B} يذهبون للتسوق مع بما أنهم أصدقاء فيتشتتون بالعب و ينسون أنهم يجب أن يذهبو للتسوق بعد ذالك يتذكر{B}ويقول أننا نسينا أن نفعل شيئا ما لكن لا أتذكر.",
"{B} هو أمير أو أميرة {A}, بستاني القلعة الذي يعتني بأوراق الشجر المحيطة بالقصر{B} فجأة يطل و يلقي التحية على البستاني.",
"{A} و {B} يشاهدون فلم رعب. {A} لك يستطيعون النوم في تلك الليلة بسبب فلم الرعب ذالك {B} لكنهم نامو و هم مراتاحين بعض أن كان أحد يحضن الآ خر و يطمئنه.",
"{A} و {B} ينامون مع بعض (هذا طبيعي لأنهم متزوجين). {A} يستيقظ مبكرا و يستمر في إيقاظه في الأخير يستيقظ {B} يعطي قبلة ل. {A} ينحني فقط ليتردد على بعد سنتيمترات من الحرج. {B} يفتح أعينه ويقول: حسنًا، إذا لم تفعي ذلك، سأفعل.'",
"{B} أصابته الحزوقة، و{A} يضحك في كل مرة تصيب {B} في الأخير نصيب الحازوقة {A} أيضا.",
"{A} و {B} لايتكلمون نفس اللغة و هذا السبب اللذي جعلهم يقعون في الحب و كل واحد يتعلم لغة الآخر معا.",
"{B} و {A} ينفصلان، لكن لديهما حيوانًا أليفًا ولا يريد أي منهما التخلي عنه. ثم يقضون بضعة أيام مع الحيوان الأليف على حدة. لكنه يساعدهم نوعًا ما على الاجتماع معًا مرة أخرى.",
"{A} و {B} يرقصون تحت ضوء القمر.",
"{A} و {B} في حديقة ترفيهية أو كرنفال، يقومان بالمشي نحو إحدى الألعاب العديدة للفوز بحيوان كبير محشو. {A}  متأكد أنه قادر على الفوز باللعبة، ولكن بعد عدة محاولات (والكثير من الأموال التي تم هدرها) {A} قام بالإستسلام و. {B}, ينجح و يفوز بالدب المحشو.",
"{B} و {A} يقومان بتناول السباغيتي في ليلة رومانسية في روما ليلا.",
"{B} هو شبح قد قم بالوقوع في الحب من {A}, لكن {A} لكن لا تستطيع رؤيته لأن {B}لا يقوم بأي شيء ليجعل {A} تلاحظه",
"{A} و {B} غير قادرين على النوم بعد مشاهدة فيلم رعب، لكن لا أحد منهم يعترف بأن الفيلم أخافهم.",
"{B} و {A} لعب الإعصار. الأمور تصبح محرجة ومحرجة بسرعة.",
"{A} يحاول تشغيل شيء ما على جهاز الكمبيوتر الخاص به. بينما يشعر بالإحباط والانقلاب, {B} يجلس بجانبه و يواسيه.",
"{A} و {B} يجدون أنفسهم عالقين في كوخ بعيد أثناء عاصفة ثلجية، مما يجبرهم على قضاء وقت ممتع معًا(ولا داعي لذالك التفكير المتسخ كانو فقط يلعبون لعبة الأوراق مثل مونوبولي).",
"{A} و {B} يقرران تحدي بعضهما البعض في سلسلة من الجرأة المضحكة وغير التقليدية.",
"{B} يفاجئ {A} ب رسالة حب صادقة، مما يجعل الأمسية أكثر رومانسية وعاطفية.",
"{A} و {B} انطلق في مغامرة عفوية واستكشف مدينة ملاهي مهجورة ليلاً.",
"{B} يقوم بتعليم {A} هواية جديدة، ويترابطون حول عملية التعلم ويتشاركون الضحك.",
"{A} و {B} يقوم كل منهما بتبديل الهواتف عن طريق الخطأ لمدة يوم، مما يؤدي إلى اكتشافات مسلية عن حياة بعضهما البعض.",
"في رحلة تخييم, {A}يقترح على {B} من يمكنه إنشاء خمية أحسن من الآخر {B} يقبل التحدي، ثم يبدآن التحدي وهم عازمين على الفوز ثم صدفة {A} تنقطع خيمته فيذهب {B} من أجل تقديم المساعدة ، في الأخير يتعاون {A} و {B} على بناء خيمة و في الأخير ينشأون خيمة أحسن من باقي الخيم و يحصلون على شارات الكشافة.",
"{A} و {B} يأخذون درسا في الرقص مع و يدخلون إلى مسابقة الرقص للفوز بجائزة الرقص الثنائي بالتوفيق لهما.",
"{B} يفاجئ {A} بفطور في الصباح على السرير ثم يقول {A} شكرا يا عزيزي .",
"{A} و {B} تتعرض لعاصفة ممطرة أثناء التنزه سيرًا على الأقدام ويبحثون عن ملجأ في كابينة جبلية مريحة، مما يودي بهم المطاف إلى أمسية رومانسية بجوار المدفأة."
];

export default {
  name: "ماذا_لو",
  author: "kaguya project",
  role: "member",
  description: "لعبة يدخل فيها شخصين في قصص عشوائية",
  execute: async ({ api, event, args }) => {
    const input = args.join(" ");

    if (!input.includes("-")) {
      api.sendMessage("يرجى استخدام الصيغة الصحيحة، مثل: ماذا_لو حسين - وليد", event.threadID);
      return;
    }

    const randomIndex = Math.floor(Math.random() * prompts.length);
    const randomPrompt = prompts[randomIndex];

    let msg = randomPrompt;
    const matches = input.split(/[\s-]+/);
    if (matches.length >= 2) {
      const [A, B] = matches;
      msg = msg.replace(/{A}/g, A).replace(/{B}/g, B);
    } else {
      api.sendMessage("يرجى استخدام الصيغة الصحيحة، مثل: ماذا_لو حسين - وليد", event.threadID);
      return;
    }

    api.sendMessage(msg, event.threadID, event.messageID);
  }
};